Revit 2024 API
XYZ.GetLength Method
Gets the length of this vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double GetLength()
Visual Basic
Public Function GetLength As Double
Visual C++
public:
double GetLength()
Remarks
 In 3-D Euclidean space, the length of the vector is the square root of the sum of the three coordinates squared.
See Also
XYZ Class
Autodesk.Revit.DB Namespace